In [4]:
import pandas as pd  # pip install pandas

In [7]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data) # data: 리스트 or 딕셔너리 등 다양한 형태 가능
                     # pd.Series(data, index=index) 인덱스는 선택
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
index_S = ['a','b','c','d','e']

In [9]:
ser = pd.Series(data,index=index_S) 
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
ser[0],ser['a']  # ser.iloc[0],ser.loc['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_12980\143202658.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0],ser['a']

(np.int64(1), np.int64(1))

In [26]:
ser.iloc[0],ser.loc['a']

(np.int64(1), np.int64(1))

In [17]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)

print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
population = pd.Series([9776, 2729, 1566, 3158],index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울','부산']])  # 펜시 인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [24]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

#판다스의 데이터프레임

In [26]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [27]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [11]:
scientists['Name']  # 시리즈

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [14]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: 1, dtype: object

In [28]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [29]:
#인덱스로 행 추출
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [30]:
#[행,열] 인덱싱
scientists.loc['William Gosset', 'Born']

'1876-06-13'

In [22]:
scientists.iloc[:,0:2]

                Name    Occupation
0  Rosaline Franklin       Chemist
1     William Gosset  Statistician

In [ ]:
scientists.loc['William Gosset']

In [34]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [35]:
sci1.loc[0,'Name']  # [row,col]인덱싱

'Rosaline Franklin'

In [38]:
#iloc로 william gosset의 age 추출
sci1.iloc[1,4]

np.int64(61)

In [39]:
#born, died 만 추출
sci1.iloc[:,2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [41]:
#occupation만 추출
sci1.loc[:,'Occupation']

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [58]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [61]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [67]:
sci1.to_csv('./data/data_1.csv')

In [68]:
sci1.to_csv('./data/data_2.csv', index=False)

In [74]:
df = pd.read_csv('./data/data_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [73]:
df1 = pd.read_csv('scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# pickle: 파이썬의 객체형을 저장 - 파이썬 전용 포맷
sci1.to_pickle('./data/scientists.pickle')

In [79]:
df2 = pd.read_pickle('./data/scientists.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [80]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [ ]:
# 데이터 미리보기
#  info()
#  head() / tail()

In [87]:
df1.head(3) # default:5개

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [86]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.describe()  # 기본 통계 요약

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [103]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [105]:
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [90]:
df1['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [96]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [121]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [122]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [123]:
print(df.index)    # 행 이름 출력
print(df.columns)  # 열 이름 출력

RangeIndex(start=0, stop=7, step=1)
Index(['이름', '나이', '점수'], dtype='object')

In [124]:
# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [125]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [126]:
# 열 이름 변경
df.rename(columns={'이름': 'name', '나이': 'age', '점수': 'score'})
df.rename(index={"A":"a", "B": "b"})

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [127]:
# 일부 열의 이름변경
df.rename(columns={'이름': 'Name','나이':'Age'})
# 일부 행의 이름변경
df.rename(index={'A':'a'}, inplace=True)  #inplace: 사용보다는 새롭게 할당하는것 추천
df

  name  age  score
a  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [202]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [203]:
df.iloc[0:2]  #행단위 슬라이싱 -1

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92

In [204]:
df.loc[0]  #행단위는 iloc, 이름단위 loc

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [205]:
df[df['나이'] > 25]  # 조건을 사용한 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [206]:
df[df['점수'] > 90]  #  점수>90 인 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [207]:
# 새로운 행 추가 -> loc[] 를 이용
df.loc[7] = ['홍길동',30 ,70]
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [219]:
# 열추가
df['grade'] = ['A','B','C','D','E','F','G','H']
df

    이름  s_id  나이  점수 grade
0  김철수  S001  25  85     A
1  이영희  S002  28  92     B
2  박민수  S003  22  78     C
3  정수진  S004  31  95     D
4  최영호  S005  27  88     E
5  한미래  S006  24  73     F
6  윤지원  S007  29  91     G
7  홍길동  S008  30  70     H

In [220]:
# 등급으로 열이름 변경
df.rename(columns={'grade':'등급'}, inplace=True)
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [210]:
df.insert(loc=1,column= 's_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007','S008'])

In [211]:
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [232]:
# 인덱스로 행 삭제
df.drop(0, axis=0, inplace=True)  # 'A' 인덱스의 행 삭제

In [233]:
df

    이름  s_id  나이  점수 등급
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [214]:
# 열 이름으로 열 삭제
df.drop(df.columns[4], axis=1, inplace= True)

In [234]:
df

    이름  s_id  나이  점수 등급
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [168]:
# 예: '등급'이라는 열이 2개라면 아래와 같이 위치를 알 수 있음
# duplicate_columns = [i for i, col in enumerate(df.columns) if col == '등급']
# print(duplicate_columns)
# df.drop(df.columns[duplicate_columns[0]], axis=1, inplace=True)

[4, 5]

In [235]:
df

    이름  s_id  나이  점수 등급
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G
7  홍길동  S008  30  70  H

In [216]:
# 중복된 등급 열중 하나 삭제
# 열 이름이 같은 경우 첫 번째만 남기고 나머지 제거
df = df.loc[:, ~df.columns.duplicated()]
df

    이름  s_id  나이  점수
0  김철수  S001  25  85
1  이영희  S002  28  92
2  박민수  S003  22  78
3  정수진  S004  31  95
4  최영호  S005  27  88
5  한미래  S006  24  73
6  윤지원  S007  29  91
7  홍길동  S008  30  70

In [236]:
# 인덱스의 설정
df.index

Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [237]:
df_new = df.set_index('s_id')
df_new.index

Index(['S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='s_id')

In [238]:
df_new.index

Index(['S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='s_id')

In [241]:
df_new.reset_index(inplace=True)

In [242]:
df_new

   index  s_id   이름  나이  점수 등급
0      0  S002  이영희  28  92  B
1      1  S003  박민수  22  78  C
2      2  S004  정수진  31  95  D
3      3  S005  최영호  27  88  E
4      4  S006  한미래  24  73  F
5      5  S007  윤지원  29  91  G
6      6  S008  홍길동  30  70  H

In [244]:
# 날짜로 인덱스 만들기
dr = pd.date_range('2025-06-01', periods=7)
df_new['date'] = dr

In [245]:
df_new1 = df_new.set_index('date')
df_new1

            index  s_id   이름  나이  점수 등급
date
2025-06-01      0  S002  이영희  28  92  B
2025-06-02      1  S003  박민수  22  78  C
2025-06-03      2  S004  정수진  31  95  D
2025-06-04      3  S005  최영호  27  88  E
2025-06-05      4  S006  한미래  24  73  F
2025-06-06      5  S007  윤지원  29  91  G
2025-06-07      6  S008  홍길동  30  70  H